---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NotOneCurve
source: html/026a8683-c9a3-f1b8-c0cc-4aa920345960.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NotOneCurve Property

More than one curve not allowed.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotOneCurve { get; }
```